/*
   Localizable.strings - Suomi
   modizer

   Organized by screens and feature families
*/

// ================================
// MARK: - COMMON / GENERAL
// ================================

/* Common Actions */
"Yes" = "Kyllä";
"No" = "Ei";
"Ok" = "Ok";
"Cancel" = "Peruuta";
"Close" = "Sulje";
"Save" = "Tallenna";
"Delete" = "Poista";
"Rename" = "Nimeä uudelleen";
"Extract" = "Pura";
"Cut" = "Leikkaa";
"Paste" = "Liitä";
"Create" = "Luo";
"Reset" = "Palauta";

/* Common States */
"Loading" = "Ladataan";
"Extracting" = "Puretaan";
"Seeking" = "Haetaan";
"Seeking %d%%" = "Haetaan %d%%";
"Refreshing" = "Päivitetään";
"Browsing" = "Selataan";
"Cancelling..." = "Peruutetaan...";

/* Common Messages */
"Error" = "Virhe";
"OK" = "OK";
"Warning" = "Varoitus";
"Do you want to reset to default value:\n" = "Haluatko palauttaa oletusarvon:\n";


// ================================
// MARK: - BROWSER
// ================================

/* Browser Main Keys */
"Browser_LocalBrowsing_MainKey" = "Paikallinen selaus";
"Browser_LocalBrowsing_SubKey" = "Selaa, toista ja poista paikallisia tiedostoja.";

"Browser_MODLAND_MainKey" = "MODLAND-kokoelma";
"Browser_MODLAND_SubKey" = "%d ladattavaa tiedostoa.";

"Browser_HVSC_MainKey" = "HVSC-kokoelma";
"Browser_HVSC_SubKey" = "%d ladattavaa tiedostoa.";

"Browser_Playlists_MainKey" = "Soittolistat";
"Browser_Playlists_SubKey" = "Järjestä, luo, poista ja kuuntele.";

"Browser_Favorites_MainKey" = "Suosikit";
"Browser_Favorites_SubKey" = "Kuuntele arvosteltuja kappaleita.";

"Browser_Most_played_MainKey" = "Useimmin soitetut";
"Browser_Most_played_SubKey" = "Kuuntele useimmin soitettuja kappaleita.";

"Browser_Web_MainKey" = "Verkko";
"Browser_Web_SubKey" = "Selaa Internetiä ja lataa musiikkia.";

"Browser_WorldCharts_MainKey" = "Maailman listat";
"Browser_WorldCharts_SubKey" = "Huippulistat ja latauslinkit.";

"Browser_WebVGM_MainKey" = "VGMRips";
"Browser_WebVGM_SubKey" = "Videopelien musiikkirippauksia";

"Browser_UserGuide_MainKey" = "Käyttöopas";
"Browser_UserGuide_SubKey" = "Ohjekirja, UKK, vinkit.";

/* Browser Display Modes */
"GetAllEntries_MainKey" = "Hae kaikki puuttuvat merkinnät";
"GetAllEntries_SubKey" = "Rajoitettu ensimmäiseen 256 puuttuvaan merkintään.";

"DisplayAll_MainKey" = "Listaa kaikki nimen mukaan";
"DisplayAll_SubKey" = "Nykyinen hakemisto:";

"DisplayDir_MainKey" = "Lista/Hakemisto";
"DisplayDir_SubKey" = "Kaikki polun mukaan:";

"DisplayAllPath_MainKey" = "Listaa kaikki polun mukaan";
"DisplayAllPath_SubKey" = "Kaikki nimen mukaan:";

/* Browser View Modes */
"Formats/Artists/Files" = "Formaatit/Artistit/Tiedostot";
"Artists/Formats/Files" = "Artistit/Formaatit/Tiedostot";
"Artists/Files" = "Artistit/Tiedostot";
"Formats: %d entries." = "Formaattia: %d merkintää.";
"Artists: %d entries." = "Artistia: %d merkintää.";

/* Browser Stats */
"Played %d times." = "Soitettu %d kertaa.";
"Played once." = "Soitettu kerran.";
"Never played." = "Ei koskaan soitettu.";
"%d files." = "%d tiedostoa.";
"1 file." = "1 tiedosto.";
"Size: %dKB" = "Koko: %dKB";

/* Browser Messages */
"Browser not enough mem." = "Liikaa merkintöjä, muistin varaus epäonnistui.";
"Browser not enough mem. Limited." = "Liikaa merkintöjä, muistin varaus epäonnistui. Lista on epätäydellinen.";

/* File Operations */
"New folder" = "Uusi kansio";
"Enter folder name" = "Anna kansion nimi";
"Nothing to paste" = "Ei mitään liitettävää";
"No file to extract or not supported archive format.\n" = "Ei purettavaa tiedostoa tai arkistomuoto ei ole tuettu.\n";
"Cannot use iCloud as folder name" = "iCloud ei voi olla kansion nimi";

"Issue %d while trying to delete entry.\n%@" = "Ongelma %d merkinnän poistossa.\n%@";
"Issue %d while trying to renamefile.\n%@" = "Ongelma %d tiedoston nimeämisessä.\n%@";
"Issue %d while moving: %@.\n%@" = "Ongelma %d siirrossa: %@.\n%@";
"Issue %d while creating folder\n%@" = "Ongelma %d kansion luonnissa\n%@";

"File is not available locally.\nTrigerring download from iCloud, please check in 'Files' application." = "Tiedosto ei ole saatavilla paikallisesti.\nAloitetaan lataus iCloudista, tarkista 'Tiedostot'-sovelluksesta.";

"unavailable" = "ei saatavilla";

// ================================
// MARK: - SEARCH
// ================================

/* Search States */
"Playlist (%d)" = "Soittolista (%d)";
"Playlist/Search off" = "Soittolista/Haku pois";

"Local (%d, limited to %d)" = "Paikalliset (%d, rajattu %d:ään)";
"Local (%d)" = "Paikalliset (%d)";
"Local/Search off" = "Paikalliset/Haku pois";

"Modland (%d, limited to %d)" = "Modland (%d, rajattu %d:ään)";
"Modland (%d)" = "Modland (%d)";
"Modland/Search off" = "Modland/Haku pois";

"HVSC (%d, limited to %d)" = "HVSC (%d, rajattu %d:ään)";
"HVSC (%d)" = "HVSC (%d)";
"HVSC/Search off" = "HVSC/Haku pois";

"ASMA (%d, limited to %d)"="ASMA (%d, rajattu %d:ään)";
"ASMA (%d)"="ASMA (%d)";
"ASMA/Search off"="ASMA/Haku pois";

/* Search Messages */
"Searching Playlists..." = "Etsitään soittolistoja...";
"Searching Local files..." = "Etsitään paikallisia tiedostoja...";
"Searching MODLAND..." = "Etsitään MODLANDista...";
"Searching HVSC..." = "Etsitään HVSC:stä...";

"Please enter at least 2 characters for your search." = "Syötä vähintään 2 merkkiä hakuun.";
"Please activate at least 1 section for your search." = "Aktivoi vähintään 1 osio hakuun.";


// ================================
// MARK: - PLAYER / NOW PLAYING
// ================================

/* Player States */
"Now playing" = "Nyt soi";
"Now playing(%d)" = "Nyt soi(%d)";
"Most played" = "Useimmin soitetut";
"Favorites" = "Suosikit";
"Resuming last\nplayed file" = "Jatketaan viimeksi\nsoitettua tiedostoa";

/* Player Controls */
"Previous" = "Edellinen";
"Previous file" = "Edellinen tiedosto";
"Next file" = "Seuraava tiedosto";
"Next" = "Seuraava";
"Shuffle" = "Satunnaistoisto";
"Voices control" = "Äänten hallinta";
"All voices" = "Kaikki äänet";
"Clear 'Now Playing' queue" = "Tyhjennä 'Nyt soi' -jono";

/* Song Selection */
"Choose a subsong" = "Valitse alakappale";
"Choose a song" = "Valitse kappale";

/* Player Messages */
"Nothing currently playing. Please select a file." = "Ei mitään soitossa. Valitse tiedosto.";
"File cannot be played. Skipping to next playable file." = "Tiedostoa ei voi toistaa. Siirrytään seuraavaan toistettavaan tiedostoon.";
"Too much entries! Playlist will be limited to %d first entries." = "Liikaa merkintöjä! Soittolista rajoitetaan %d ensimmäiseen merkintään.";
"Playlist is full. Delete some entries to add more." = "Soittolista on täynnä. Poista merkintöjä lisätäksesi uusia.";

/* Metadata */
"unknown_title" = "Tuntematon kappale";
"unknown_album" = "Tuntematon albumi";
"now_playing_format" = "Soitetaan: %@ albumilta %@";


// ================================
// MARK: - PLAYLISTS
// ================================

/* Playlist Actions */
"New playlist" = "Uusi soittolista";
"Create new playlist" = "Luo uusi soittolista";
"Save current one" = "Tallenna nykyinen";
"Rename playlist" = "Nimeä soittolista uudelleen";
"Add to a playlist" = "Lisää soittolistalle";
"Choose a playlist" = "Valitse soittolista";

/* Playlist Descriptions */
"Create a new empty playlist." = "Luo uusi tyhjä soittolista.";
"Create a playlist from currently played files." = "Luo soittolista tällä hetkellä soitetuista tiedostoista.";
"Browse files" = "Selaa tiedostoja";
"Add or remove entries from browser." = "Lisää tai poista merkintöjä selaimesta.";
"Choose a new name." = "Valitse uusi nimi.";

/* Playlist Confirmations */
"Are you sure you want to delete this playlist ?" = "Haluatko varmasti poistaa tämän soittolistan?";
"Are you sure you want to delete this entry ?" = "Haluatko varmasti poistaa tämän merkinnän?";


// ================================
// MARK: - DOWNLOADS
// ================================

"Downloads" = "Lataukset";
"Download queue: 1 file" = "Lataujono: 1 tiedosto";
"Download queue: %d files" = "Lataujono: %d tiedostoa";
"No download in progress" = "Ei latauksia käynnissä";
"Downloaded %@" = "Ladattu %@";
"Downloading %@" = "Ladataan %@";
"Cannot download from this URL." = "Ei voida ladata tästä URL-osoitteesta.";
"Could not add files. Please check manually with file browser (Local Browsing/Downloads)." = "Tiedostoja ei voitu lisätä. Tarkista manuaalisesti tiedostoselaimella (Paikallinen selaus/Lataukset).";
"File already available locally. Do you want to download it again?" = "Tiedosto on jo saatavilla paikallisesti. Haluatko ladata sen uudelleen?";
"URL have to start with ftp:// or http://" = "URL:n täytyy alkaa ftp:// tai http://";
"Cannot connect to FTP." = "FTP-yhteys epäonnistui.";


// ================================
// MARK: - DATABASE
// ================================

"Database created." = "Tietokanta luotu.";
"Database will now be recreated. Please validate & wait." = "Tietokanta luodaan nyt uudelleen. Vahvista ja odota.";
"Wrong database version: %d.%d. Will update to %d.%d. Please validate & wait." = "Väärä tietokannan versio: %d.%d. Päivitetään versioon %d.%d. Vahvista ja odota.";
"No database found. Will create a new one. Please validate & wait..." = "Tietokantaa ei löytynyt. Luodaan uusi. Vahvista ja odota...";


// ================================
// MARK: - COVERS / IMAGES
// ================================

"Image detected" = "Kuva havaittu";
"Choose_SaveCover" = "Tallenna kuva kansikuvaksi kohteelle %@?";
"CoverFolder" = "Kansion kansikuvaksi";
"CoverFile" = "Tiedoston kansikuvaksi";
"Confirm_RemCurCovers" = "Poista nykyiset kansikuvat kohteesta %@ (kansio ja tiedosto)?";


// ================================
// MARK: - SETTINGS - GENERAL
// ================================

/* Settings Sections */
"Settings_General" = "Yleiset";
"Settings_Player" = "Soitin";
"Settings_Display" = "Näyttö";
"Settings_Download" = "Lataus";
"Settings_FTP" = "FTP";
"Settings_PlaybackLib" = "Toistokirjastot";
"Settings_Settings" = "Asetukset";

/* Settings Presets */
"Settings_SettingsDefault" = "Oletus";
"Settings_SettingsHigh" = "Korkea";
"Settings_SettingsMed" = "Keskitaso";
"Settings_SettingsLow" = "Matala";

"Confirm_SettingsDef" = "Haluatko varmasti palauttaa asetukset 'oletus'-arvoihin?";
"Confirm_SettingsHigh" = "Haluatko varmasti palauttaa asetukset 'korkea'-arvoihin?";
"Confirm_SettingsMed" = "Haluatko varmasti palauttaa asetukset 'keskitaso'-arvoihin?";
"Confirm_SettingsLow" = "Haluatko varmasti palauttaa asetukset 'matala'-arvoihin?";

/* Global Player Settings */
"Search: simplified regexp ('.'->'\\.', '*'->'.*')" = "Haku: yksinkertaistettu regexp ('.'->'\\.', '*'->'.*')";
"Resume position on launch" = "Jatka toistoa käynnistettäessä";
"Notification" = "Ilmoitus";
"Notification duration" = "Ilmoituksen kesto";
"Disable screen auto lock" = "Poista näytön autom. lukitus";
"No screen auto lock" = "Ei näytön autom. lukitusta";
"Enable playback ratio" = "Käytä toistosuhde";
"Playback ratio" = "Toistosuhde";
"Default length" = "Oletuspituus";
"Default length %d:%.2d" = "Oletuspituus %d:%.2d";
"Fade-out time" = "Häivytysaika";
"Silence Detection" = "Hiljaisuuden tunnistus";
"Stop song if silent for more than selected number of seconds. 0: off" = "Pysäytä kappale, jos hiljainen yli valitun sekuntimäärän. 0: pois";
"Will skip song if nothing is played for specified duration (0=off)" = "Ohittaa kappaleen, jos mitään ei toisteta määritetyn ajan (0=pois)";
"Force mono" = "Pakota mono";
"Panning" = "Panorointi";
"Panning value" = "Panorointiarvo";
"Audio latency" = "Äänen viive";
"Audio latency in ms" = "Äänen viive ms:ssa";
"Multi default action" = "Moni oletustoiminto";
"Browse" = "Selaa";
"Archive/multi play mode" = "Arkisto/monitoistotila";
"Entry"="Merkintä";

/* Archive Settings */
"Archive multi default action" = "Arkiston moni oletustoiminto";
"Archive multi play mode" = "Arkiston monitoistotila";

/* Playlist Settings */
"Play/Enqueue action" = "Toista/Jonota -toiminto";
"Enqueue mode" = "Jonotustila";
"Default Action" = "Oletustoiminto";
"Play" = "Toista";
"Enqueue" = "Jonota";
"Enq.&Play" = "Jon.&Toista";
"First" = "Ensimmäinen";
"Current" = "Nykyinen";
"Last" = "Viimeinen";
"Enqueue position" = "Jonotuspaikka";
"Post download action" = "Latauksen jälkeinen toiminto";
"Nothing" = "Ei mitään";

/* Display Settings */
"Background mode" = "Taustatila";
"Partial" = "Osittainen";
"Full" = "Täysi";
"Off=no background process, Partial=keep playing music, Full=keep app on in background" = "Pois=ei taustaprosessia, Osittainen=jatka musiikin soittoa, Täysi=pidä sovellus päällä taustalla";
"Long name truncate" = "Pitkän nimen katkaisu";
"Head" = "Alku";
"Mid." = "Keski";
"Tail" = "Loppu";
"Filename as title" = "Tiedostonimi otsikkona";

/* Local Files Settings */
"Auto. restore Samples folder" = "Autom. palauta Samples-kansio";
"Send statistics" = "Lähetä tilastoja";


// ================================
// MARK: - SETTINGS - DATABASE
// ================================

"Settings_DB" = "Tietokanta";
"Settings_CleanDB" = "Puhdista tietokanta";
"Settings_ResetPlCnt" = "Nollaa toistolaskurit";
"Settings_ResetRatings" = "Nollaa arvostelut";
"Settings_ResetDB" = "Nollaa koko tietokanta";

"Confirm_DBClean" = "Käynnistä tietokannan puhdistus (voi kestää hetken)?";
"Confirm_Reset_PlCnt" = "Haluatko varmasti nollata kaikki toistolaskurit?";
"Confirm_Reset_Ratings" = "Haluatko varmasti nollata kaikki arvostelut?";
"Confirm_ResetDB" = "Haluatko varmasti nollata koko tietokannan? Soittolistat, arvostelut ja laskurit poistetaan.";


// ================================
// MARK: - SETTINGS - LOCAL FILES
// ================================

"Settings_LocalFiles" = "Paikalliset tiedostot";
"Settings_RecreateSamples" = "Luo 'Samples'-kansio uudelleen";
"Settings_FormatDownloads" = "Alusta 'Downloads'-kansio";
"Settings_RemCovers" = "Poista kansikuvat";
"Settings_UpdateFilesBackupFlag" = "Tarkista tiedostojärjestelmä";

"Confirm_RecreateSamples" = "Haluatko luoda 'Samples'-kansion uudelleen?";
"Confirm_FormatDownloads" = "Haluatko poistaa KAIKKI tiedostot Paikallinen selaus/Web-kansiosta?";
"Confirm_CheckFiles" = "Haluatko suorittaa paikallisen tiedostojärjestelmän tarkistuksen?";


// ================================
// MARK: - SETTINGS - PLUGINS
// ================================

/* AdPlug */
"OPL type" = "OPL-tyyppi";
"Stereo surround" = "Stereo surround";

/* GBSPlay */
"HP filter type" = "HP-suodatintyyppi";
"Highpass filter type" = "Ylipäästösuodatintyyppi";

/* Game Music Emu (GME) */
"Stereo separation" = "Stereoerottelu";
"Ignore silence" = "Ohita hiljaisuus";
"Silence detection" = "Hiljaisuuden tunnistus";
"Equalizer" = "Taajuuskorjain";
"Bass" = "Basso";
"Treble" = "Diskantti";

/* GSF */
"Sound quality" = "Äänenlaatu";
"Interpolation" = "Interpolointi";
"Low-pass filter" = "Alipäästösuodatin";
"Echo" = "Kaiku";

/* Highly Complete (HC) */
"Resample quality" = "Uudelleennäytteistyksen laatu";
"Main enabled" = "Pää käytössä";
"Reverb enabled" = "Kaiku käytössä";

/* NSFPlay */
"NSFPLAY default length" = "NSFPLAY oletuspituus";
"LPF strength" = "LPF vahvuus";
"Min=off, default: 112" = "Min=pois, oletus: 112";
"HPF strength" = "HPF vahvuus";
"Region" = "Alue";
"VRC7 Patches" = "VRC7 Patchit";
"Force IRQ" = "Pakota IRQ";
"Quality" = "Laatu";

/* OpenMPT */
"Master volume" = "Päääänenvoimakkuus";
"Sampling" = "Näytteistys";
"Resampling" = "Uudelleennäytteistys";

/* SID */
"Engine" = "Moottori";
"Filter" = "Suodatin";
"Force loop" = "Pakota silmukka";
"Clock" = "Kello";
"Model" = "Malli";
"Force 2nd SID" = "Pakota 2. SID";
"Address 2nd" = "Osoite 2.";
"0xD420-0xD7FF or 0xDE00-0xDFFF" = "0xD420-0xD7FF tai 0xDE00-0xDFFF";
"Force 3rd SID" = "Pakota 3. SID";
"Address 3rd" = "Osoite 3.";

/* Timidity */
"Max loop" = "Maksimi silmukat";
"MIDI polyphony" = "MIDI-polyfonia";
"Amplification" = "Vahvistus";
"Chorus" = "Kuoro";
"Reverb" = "Kaiku";
"Resample" = "Uudelleennäytteistä";
"LP filter" = "LP-suodatin";

/* UADE */
"Headphones" = "Kuulokkeet";
"LED filter" = "LED-suodatin";
"Normalization" = "Normalisointi";
"Post FX" = "Jälkitehoste";
"Panning" = "Panorointi";
"Panning value" = "Panorointiarvo";
"Gain" = "Vahvistus";
"Gain value" = "Vahvistusarvo";
"Force NTSC" = "Pakota NTSC";

/* VGMPlay */
"Prefer JTAG" = "Suosi JTAG";
"YM2612 emulator" = "YM2612-emulaattori";
"Nuked OPN2 option" = "Nuked OPN2 -vaihtoehto";
"YMF262 emulator" = "YMF262-emulaattori";
"YM3812 emulator" = "YM3812-emulaattori";
"QSound emulator" = "QSound-emulaattori";
"RF5C68 emulator" = "RF5C68-emulaattori";

/* VGMStream */
"Max loop" = "Maksimi silmukat";

/* XMP */
"Amiga 500 Filter" = "Amiga 500 -suodatin";


// ================================
// MARK: - SETTINGS - VISUALIZATIONS
// ================================

/* General FX */
"FX Alpha" = "FX Alpha";
"FX Fullscreen" = "FX Koko näyttö";
"FX FPS" = "FX FPS";
"FX show info" = "FX näytä tiedot";
"Tech Info" = "Tekninen info";
"Show FPS and other infos (CPU, Resolution, ProjectM audio data)" = "Näytä FPS ja muut tiedot (CPU, resoluutio, ProjectM-äänidata)";
"FX Level of details" = "FX Yksityiskohtien taso";
"Low" = "Matala";
"Med" = "Keski";
"High" = "Korkea";
"Slow FX limit" = "Hidasta FX-raja";
"Deactivate FX if too slow." = "Poista FX käytöstä, jos liian hidas.";
"Weak" = "Heikko";
"Strong" = "Voimakas";
"Display song info" = "Näytä kappaleen tiedot";
"When in fulllscreen, display song info when it changes. TL is Top Left, DR is Bottom Right, C is Center." = "Koko näytön tilassa näytä kappaleen tiedot, kun se vaihtuu. TL=Vasen ylä, DR=Oikea ala, C=Keskellä.";

/* ProjectM */
"ProjectM settings" = "ProjectM-asetukset";
"ProjectM on/off" = "ProjectM päällä/pois";
"Show preset label" = "Näytä esiasetuksen nimi";
"Auto switch presets mode" = "Automaattinen esiasetusten vaihto";
"Lock preset" = "Lukitse esiasetus";
"Time between preset" = "Aika esiasetusten välillä";
"Blend presets" = "Sekoita esiasetukset";
"Blend time" = "Sekoitusaika";
"Bundled presets" = "Sisäänrakennetut esiasetukset";
"Custom presets" = "Mukautetut esiasetukset";
"Aspect ratio" = "Kuvasuhde";
"Mesh size X" = "Verkon koko X";
"Mesh size Y" = "Verkon koko Y";
"Hard cut enabled" = "Kova leikkaus käytössä";
"Hard cut min time" = "Kovan leikkauksen min. aika";
"Hard cut sensitivity" = "Kovan leikkauksen herkkyys";
"Beat sensitivity" = "Rytmin herkkyys";
"Permissive mode" = "Salliva tila";

/* Oscilloscope */
"Oscillo settings" = "Oskilloskooppi-asetukset";
"FX mode" = "FX-tila";
"Show label" = "Näytä nimike";
"Label font size" = "Nimikkeen fonttikoko";
"Show grid" = "Näytä ruudukko";
"Grid color" = "Ruudukon väri";
"Line width" = "Viivan leveys";
"Mono color" = "Monoväri";
"Multi color set" = "Monivärisetti";
"Reset all colors" = "Nollaa kaikki värit";
"Thin" = "Ohut";
"Medium" = "Keskitaso";
"Thick" = "Paksu";
"Beefy" = "Erittäin paksu";

/* Piano Roll / MIDI */
"Piano roll" = "Pianorulla";
"Activate Piano roll FX, standard or 'Synthesia' like" = "Aktivoi pianorulla-FX, tavallinen tai 'Synthesia'-tyylinen";
"Activate spark FX, colored or white" = "Aktivoi kipinä-FX, värillinen tai valkoinen";
"Display voices labels" = "Näytä äänten nimiket";
"Display octaves labels" = "Näytä oktaavien nimiket";
"MIDI pattern" = "MIDI-kuvio";
"MIDI cut line" = "MIDI-leikkausviiva";
"MIDI bar style" = "MIDI-palkkityyli";
"MIDI bar vibrato" = "MIDI-palkin vibrato";
"Piano 3D" = "Piano 3D";
"Piano cut line" = "Pianon leikkausviiva";
"Piano color mode" = "Pianon väritila";

/* Spectrum */
"3D spectrum" = "3D-spektri";
"3D spectrum bloom" = "3D-spektrin hehku";
"Spectrum" = "Spektri";
"3D landscape" = "3D-maisema";
"3D landscape bloom" = "3D-maiseman hehku";

/* MOD Pattern */
"MOD pattern" = "MOD-kuvio";
"MOD pattern BG alpha" = "MOD-kuvion taustan alpha";
"MOD pattern vol bar" = "MOD-kuvion äänenvoimakkuuspalkki";
"MOD pattern current line mode" = "MOD-kuvion nykyisen rivin tila";
"MOD pattern font" = "MOD-kuvion fontti";
"MOD pattern font size" = "MOD-kuvion fonttikoko";
"MOD pattern theme" = "MOD-kuvion teema";


// ================================
// MARK: - WEB BROWSER
// ================================

"Browser_Welcome_Message" = "<b>Tervetuloa Modizerin verkkoselaimeen!</b><br><br>Käytä ylhäällä olevaa osoitepalkkia navigointiin tai selaa kirjanmerkkejäsi.<br><br>Käyttääksesi kuvaa kansikuvana, kopioi se leikepöydälle pitkällä painalluksella.";
"Bookmarks" = "Kirjanmerkit";


// ================================
// MARK: - ABOUT
// ================================

"About_Text" = "v4.1 © Yohann Magnien / YoyoFR\n\nYhteys: mailto:modizerhelp@gmail.com\nVerkko: https://modizer.app\n\nModizerin logo: Steve Miele.\n\nTuettujen tiedostomuotojen/laajennusten määrä: 1090.\n!PM!,04SW,208,2DX9,2PSF,2SF,2SFLIB,3DO,4,40A,40B,41A,50A,60A,61A,669,800,9TAV,A2M,AAC,AAM,AAX,ABK,AC1,AC1D,ACB,ACM,ACX,ADL,ADLIB,ADM,ADP,ADPCM,ADPCMX,ADS,ADSC,ADW,ADX,AFC,AFS2,AGD,AGI,AGSC,AHV,AHX,AI,AIF,AIF-LOOP,AIFC,AIFCL,AIFF,AIFFL,AIX,AKB,AL,AL2,ALP,AMC,AMD,AMF,AMS,AMTS,AO,AON,AON4,AON8,AP,APC,APE,AS0,AS3M,AS4,ASC,ASD,ASF,ASR,ASS,AST,AT3,AT9,ATSL,ATSL3,ATSL4,ATX,AUD,AUS,AVAL,AVP,AWB,AWC,AY,B1S,BAF,BAKA,BAM,BANK,BAO,BAR,BCSTM,BCWAV,BD,BD3,BDS,BDSP,BFC,BFSTM,BFWAV,BFWAVNSMBU,BG00,BGM,BGW,BH2PCM,BIK,BIK2,BIKA,BIN,BK2,BLK,BMDX,BMF,BMS,BNK,BNM,BNS,BNSF,BO2,BP,BP3,BRSTM,BRSTMSPM,BSF,BSI,BSND,BSS,BTSND,BVG,BWAV,BYTES,C64,C67,CAF,CAPDSP,CBD2,CC3,CCC,CD,CFF,CFN,CHAN,CHI,CHK,CHP,CIN,CKB,CKD,CKS,CM,CM3,CMC,CMF,CMR,CMS,CNK,COP,CORE,CP,CPK,CPLX,CPS,CRB,CSB,CSMP,CTRL,CUS,CUST,CUSTOM,CVS,CWAV,CXS,D00,DA,DAT,DATA,DAX,DB,DBM,DCS,DCT,DDSP,DE2,DEC,DFM,DH,DI,DIGI,DIVA,DL,DLM1,DLM2,DLN,DLT,DL_DELI,DM0,DM1,DM2,DMC,DMF,DMM,DMO,DMSG,DMU,DMU2,DNS,DODA,DP,DR0,DRO,DS2,DSB,DSC,DSF,DSFLIB,DSM,DSP,DSPW,DSQ,DSR,DSS,DST,DTK,DTM,DUM,DVI,DW,DWOLD,DXH,DZ,E4X,EA,EAM,EAS,EMFF,EMOD,EMS,EMSV6,ENM,ENO,ENS,ESV,ET1,EU,EUP,EX,EXA,EZW,FAG,FAR,FC,FC-BSI,FC-M,FC13,FC14,FC3,FC4,FCM,FDA,FDI,FFW,FILP,FLAC,FLX,FMB,FNK,FP,FRED,FSB,FSV,FT,FTC,FUZ,FUZZ,FW,FWAV,FWSE,G1L,GAM,GAMPLUS,GBR,GBS,GBTS,GCA,GCM,GCUB,GCW,GDM,GENH,GIN,GLUE,GM,GMC,GMS,GOT,GRAY,GSB,GSF,GSFLIB,GTD,GTR,GV,GWM,GYM,H4M,HA2,HAB,HBT,HCA,HD,HDR,HES,HGC1,HIP,HIP7,HIPC,HIS,HMC,HN,HPS,HRM,HRP,HRT,HRT!,HSC,HSF,HSP,HSQ,HST,HVL,HWAS,HX2,HX3,HXC,HXD,HXG,HXX,IAB,IADP,ICE,IDMSF,IDSP,IDVI,IDWAV,IDXMA,IFS,IKM,ILD,IMA,IMC,IMF,IMS,IMX,INSTR,INT,IS,IS14,IS20,ISB,ISD,ISWS,IT,IT1,ITL,IVAG,IVAUD,IVB,J2B,JAM,JBM,JC,JCB,JCBO,JD,JMF,JO,JOE,JP,JPN,JPND,JPO,JPOLD,JSTM,JT,KAT,KCES,KCEY,KEF,KEF7,KH,KM9,KNS,KOVS,KRAW,KRIS,KRS,KSM,KSS,KTAC,KTSL2ASBIN,KTSS,KVS,L,LAA,LAAC,LAIF,LAIFC,LAIFF,LASF,LAX,LBIN,LDS,LEG,LEP,LIN,LIQ,LM0,LM1,LM2,LM3,LM4,LM5,LM6,LM7,LME,LMP3,LMP4,LOGG,LOPUS,LP,LPCM,LPK,LPS,LRMB,LSE,LSF,LSTM,LWAV,LZS,M,M15,M2,M3U,M4A,M4V,MA,MAB,MAD,MAP,MATX,MAX,MBM,MC,MC3,MCA,MCADPCM,MCG,MCMD,MCMD_ORG,MCO,MCR,MD,MDAT,MDI,MDL,MDS,MDSP,MDST,MDX,MDY,MED,MEXXMP,MFP,MG,MGS,MI4,MIB,MIC,MID,MIDI,MIHB,MINI2SF,MINIDSF,MINIGSF,MININCSF,MINIPSF,MINIPSF2,MINIQSF,MINISNSF,MINISSF,MINIUSF,MJB,MK2,MKF,MKII,MKIIO,MKJ,ML,MM4,MM8,MMCMP,MMD0,MMD1,MMD2,MMD3,MMD4,MMDC,MMS,MNSTR,MO3,MOD,MOD15,MOD15_MST,MOD15_ST-IV,MOD15_UST,MOD_ADSC4,MOD_COMP,MOD_DOC,MOD_FLT4,MOD_NTK,MOD_NTK1,MOD_NTK2,MOD_NTKAMP,MOGG,MOK,MON,MON_OLD,MP3,MP4,MPD,MPDSP,MPF,MPG,MPK,MPRO,MPT,MPTM,MS,MSA,MSADPCM,MSB,MSC,MSD,MSF,MSO,MSP,MSS,MSV,MSVP,MT2,MTA2,MTAF,MTK,MTM,MTP2,MTR,MUG,MUG2,MUL,MUPS,MUS,MUSC,MUSX,MW,MWV,MXST,MYSPD,MZ,N64,NAAC,NCSF,NCSFLIB,NDP,NDS,NGCA,NLSD,NOISEPACKER2,NOISEPACKER3,NOP,NP,NP1,NP2,NP3,NPS,NPSF,NR,NRU,NSF,NSFE,NSOPUS,NST,NTP,NTPK,NUB,NUB2,NUS3AUDIO,NUS3BANK,NWA,NWAV,NXA,OCTAMED,OGG,OGL,OKT,OMU,ONE,OPI,OPUS,OPUSX,OPX,ORG,OSP,OTM,OVB,OVI,OXM,OZI,P,P00,P10,P21,P2BT,P30,P3D,P40A,P40B,P41A,P4X,P50A,P5A,P5X,P60,P60A,P61,P61A,P6X,P86,PAP,PAST,PCD,PCM,PDT,PDX,PFLT,PHA,PIN,PIS,PK,PLM,PM,PM0,PM01,PM1,PM10C,PM18A,PM2,PM20,PM4,PM40,PMB,PMZ,PNB,POLK,PONA,POS,POWT,PP10,PP20,PP21,PP30,PPC,PPK,PPM,PPS,PPZ,PR1,PR2,PRG,PROM,PRU,PRU1,PRU2,PRUN,PRUN1,PRUN2,PS,PS2STM,PSA,PSC,PSF,PSF2,PSF2LIB,PSFLIB,PSG,PSH,PSID,PSM,PSND,PSW,PT,PT1,PT2,PT3,PT36,PTCOP,PTM,PTTUNE,PUMA,PVI,PVP,PWR,PXA,PYG,PYGM,PYGMY,PZI,QC,QPA,QSF,QSFLIB,QTS,R,RAC,RAD,RAK,RAS,RAW,RH,RHO,RIFF,RIX,RJP,RK,RKB,RKV,RMT,RND,ROF,ROL,RPGMVO,RRDS,RSD,RSF,RSID,RSM,RSP,RSTM,RTM,RWAR,RWAV,RWS,RWSD,RWX,RXW,S-C,S14,S3M,S7G,S98,S98xxxxxxxxx,SA,SA-P,SA2,SAB,SAD,SAF,SAP,SAS,SAT,SA_OLD,SB,SB0,SB1,SB2,SB3,SB4,SB5,SB6,SB7,SBIN,SBK,SBR,SBV,SC,SC68,SCD,SCH,SCI,SCL,SCN,SCR,SCT,SCUMM,SD9,SDB,SDF,SDR,SDT,SEB,SED,SEG,SF0,SF2,SFL,SFM,SFS,SFX,SFX13,SFX2,SG,SGB,SGC,SGD,SGX,SID,SID1,SID2,SJS,SKT,SKYT,SL3,SLI,SM,SM0,SM1,SM2,SM3,SM4,SM5,SM6,SM7,SMC,SMK,SMN,SMP,SMPL,SMPRO,SMUS,SMV,SND,SNDH,SNDMON,SNDS,SNG,SNGW,SNK,SNR,SNS,SNSF,SNSFLIB,SNT,SNT!,SNU,SNX,SOC,SOD,SOG,SON,SONIC,SOP,SPC,SPD,SPK,SPL,SPM,SPS,SPSD,SPW,SQD,SQT,SQX,SS,SS2,SSF,SSFLIB,SSM,SSS,ST,ST1,ST2,ST26,ST3,ST30,STAR,STC,STER,STK,STM,STMA,STP,STPK,STR,STREAM,STRM,STS,STX,SUN,SVAG,SVG,SVS,SWAG,SWAV,SWD,SWITCH_AUDIO,SX,SXD,SXD1,SXD2,SXD3,SYN,SYNMOD,SZX,TD0,TEC,TF,TF0,TFC,TFD,TFE,TFHD1.5,TFHD7V,TFHDPRO,TFMX,TFMX1.5,TFMX7V,TFMXPRO,TGQ,TGV,THM,THN,THP,THX,TINY,TK5,TLZ,TLZP,TM2,TM8,TMC,TME,TMX,TP,TP1,TP2,TP3,TPU,TRA,TRC,TRD,TRO,TRONIC,TRS,TS,TUN,TW,TWO,TXT,TXTH,TXTP,TYDSP,UDS,UE4OPUS,ULT,ULW,UM3,UMX,UN2,UNIC,UNIC2,USF,USFLIB,UTK,UV,V0,V1,V2M,V2MZ,VA3,VAG,VAI,VAS,VAWX,VB,VBK,VDM,VDS,VGM,VGS,VGV,VGZ,VID,VIG,VIS,VMS,VOI,VP6,VPK,VS,VSF,VSS,VSV,VTX,VXN,WAA,WAC,WAD,WAF,WAM,WAS,WAV,WAVC,WAVE,WAVEBATCH,WAVM,WAY,WB,WB2,WBD,WD,WEM,WII,WLF,WMA,WMUS,WN,WOW,WP2,WPD,WSD,WSI,WSR,WUA,WV2,WV6,WVE,WVS,WVX,X,XA,XA2,XA30,XAD,XAG,XAN,XANN,XAU,XAV,XEN,XM,XMA,XMA2,XMD,XMU,XNA,XNB,XOPUS,XPK,XPS,XSE,XSEW,XSF,XSM,XSS,XVAG,XVAS,XWAV,XWB,XWC,XWM,XWMA,XWS,XWV,YDSP,YM,YMF,ZEN,ZIC,ZSD,ZSM,ZSS,ZWDSP,ZWV,ZXZIP\nIntegroidut soitinkirjastot:\n- Adplug\n- Another Slight Atari Player(ASAP)\n- AtariSound\n- Eupmini\n- ffmpeg/mpg123/vorbis\n- Game Music Emu\n- FMPmini\n- Highly Complete\n- AHX/Hively tracker\n- LazyUSF\n- Libvgm\n- Mdxplay\n- NSFPlay\n- OpenMPT\n- PlayGSF\n- Pmdmini\n- PxTone / Organya\n- PT3Player\n- SC68\n- Sibplayfp\n- Snes9x/snsf\n- ST-Sound\n- Timidity(käyttää Merlin_gold SF2 -soundfonttia)\n- UADE\n- XSF (2SF, NCSF)\n- XMP\n-V2M tinyplayer\n- VGMStream\n- VIO2SF\n- WebSID\n- ZXTune\n\nVastuuvapauslauseke:\nInternet-yhteydet Modland-, HVSC- ja ASMA-kirjastoihin tarjotaan sellaisenaan, saatavuudelle ja/tai toimivuudelle ei anneta takuuta. Käytä tätä sovellusta omalla vastuullasi.";


// ================================
// MARK: - SUPPORT
// ================================

"Mail support" = "Sähköpostituki";
"Contact support by email" = "Ota yhteyttä tukeen sähköpostitse";
"[Please describe your request below]" = "[Kuvaile pyyntösi alla]";


// ================================
// MARK: - DONATION / TIPS
// ================================

"Thank You! ❤️" = "Kiitos! ❤️";
"Send a tip to Modizer" = "Lähetä tippi Modizerille";
"Support Modizer development" = "Tue Modizerin kehitystä";


// ================================
// MARK: - LAUNCH / INITIALIZATION
// ================================

"Cleaning DB & \nreseting settings" = "Puhdistetaan tietokanta ja \npalautetaan asetukset";
"First launch or issue encountered last time Modizer was running. Apply default settings?" = "Ensimmäinen käynnistys tai ongelma havaittiin viime kerralla kun Modizer oli käynnissä. Käytetäänkö oletusasetuksia?";


// ================================
// ================================
// MARK: - SIRI / APP INTENTS
// ================================

/* Aikomusten otsikot */
"Play" = "Toista";
"Pause" = "Tauko";
"Stop" = "Pysäytä";
"Next Song" = "Seuraava kappale";
"Previous Song" = "Edellinen kappale";
"Play Subsong" = "Toista alikappale";
"Seek" = "Hae";
"Set Infinite Loop" = "Aseta ääretön silmukka";
"Set Loop Mode" = "Aseta toistotila";
"Set Shuffle Mode" = "Aseta sekoitustila";
"Toggle Shuffle" = "Vaihda sekoitusta";
"Toggle Loop Mode" = "Vaihda toistotilaa";
"Set Fullscreen mode" = "Aseta koko näytön tila";
"Go the player view" = "Siirry soittimen näkymään";
"Set FX" = "Aseta tehosteet";
"Get Now Playing" = "Hae nyt soiva";
"Get Playlists" = "Hae soittolistat";
"Play some music" = "Soita musiikkia";
"Play most played" = "Soita eniten soitettuja";
"Play favorites" = "Soita suosikit";
"Play Playlist" = "Soita soittolista";
"Play Playlist By Name" = "Soita soittolista nimellä";

/* Aikomusten kuvaukset */
"Starts playing music in Modizer." = "Aloittaa musiikin toiston Modizerissa.";
"Pauses music playback in Modizer." = "Keskeyttää musiikin toiston Modizerissa.";
"Stops music playback in Modizer." = "Pysäyttää musiikin toiston Modizerissa.";
"Skips to the next song in Modizer." = "Siirtyy seuraavaan kappaleeseen Modizerissa.";
"Skips to the previous song in Modizer." = "Siirtyy edelliseen kappaleeseen Modizerissa.";
"Plays a specific subsong in the current file." = "Toistaa tietyn alikappaleen nykyisessä tiedostossa.";
"Seeks to a specific position in the current song." = "Hakee tiettyä kohtaa nykyisessä kappaleessa.";
"Set the infinite loop mode in Modizer." = "Asettaa äärettömän silmukan tilan Modizerissa.";
"Set the loop mode in Modizer." = "Asettaa toistotilan Modizerissa.";
"Set the shuffle mode in Modizer." = "Asettaa sekoitustilan Modizerissa.";
"Toggles shuffle mode in Modizer." = "Vaihtaa sekoitustilaa Modizerissa.";
"Toggles loop mode in Modizer." = "Vaihtaa toistotilaa Modizerissa.";
"Set Fullscreen mode on or off in Modizer." = "Asettaa koko näytön tilan päälle tai pois Modizerissa.";
"Go the player view in Modizer." = "Siirtyy soittimen näkymään Modizerissa.";
"Set FX mode in Modizer." = "Asettaa tehostetilan Modizerissa.";
"Gets information about the currently playing song." = "Hakee tietoa tällä hetkellä soivasta kappaleesta.";
"Gets the list of available playlists in Modizer." = "Hakee listan saatavilla olevista soittolistoista Modizerissa.";
"Random picks from available local titles in Modizer." = "Satunnaisia valintoja saatavilla olevista paikallisista kappaleista Modizerissa.";
"Most played titles from available local titles in Modizer." = "Eniten soitetut kappaleet saatavilla olevista paikallisista kappaleista Modizerissa.";
"Favorites titles from available local titles in Modizer." = "Suosikkikappaleet saatavilla olevista paikallisista kappaleista Modizerissa.";
"Plays a specific playlist in Modizer. Note: For best results with voice commands, use 'Play Playlist By Name' instead." = "Toistaa tietyn soittolistan Modizerissa. Huomautus: Parhaan tuloksen saavuttamiseksi äänikomennoilla käytä sen sijaan 'Soita soittolista nimellä'.";
"Plays a playlist by name in Modizer. Recommended for voice commands." = "Toistaa soittolistan nimellä Modizerissa. Suositeltu äänikomennoille.";

/* Parametrit */
"Subsong Index" = "Alikappaleen indeksi";
"The index of the subsong to play" = "Toistettavan alikappaleen indeksi";
"Position (seconds)" = "Sijainti (sekunteina)";
"The position to seek to in seconds" = "Haettava sijainti sekunteina";
"Relative" = "Suhteellinen";
"Whether to seek relative to current position" = "Haku suhteessa nykyiseen sijaintiin";
"Infinite Loop Mode" = "Ääretön silmukkatila";
"0: off, 1: infinite loop" = "0: pois päältä, 1: ääretön silmukka";
"Repeat Mode" = "Toistotila";
"0: off, 1: loop current title, 2: loop playlist" = "0: pois päältä, 1: toista nykyinen kappale, 2: toista soittolista";
"Shuffle Mode" = "Sekoitustila";
"0: off, 1: choose only one title if file has subsongs or is an archive, 2: play all titles of a given file" = "0: pois päältä, 1: valitse vain yksi kappale jos tiedostossa on alikappaleita tai se on arkisto, 2: toista kaikki tietyn tiedoston kappaleet";
"Fullscreen mode" = "Koko näytön tila";
"Activate (1) or disactivate (0) Fullscreen mode" = "Aktivoi (1) tai deaktivoi (0) koko näytön tila";
"FX" = "Tehosteet";
"The FX to set" = "Asetettavat tehosteet";
"FX Mode" = "Tehostetila";
"The mode to activate for the selected FX (0:off)" = "Tila, joka aktivoidaan valituille tehosteille (0:pois päältä)";
"Playlist" = "Soittolista";
"The playlist to play" = "Toistettava soittolista";
"Start Index" = "Aloitusindeksi";
"The index of the song to start playing from (0-based)" = "Kappaleen indeksi, josta aloitetaan toisto (0-pohjainen)";
"Playlist Name" = "Soittolistan nimi";
"The name of the playlist to play" = "Toistettavan soittolistan nimi";
"Which playlist would you like to play?" = "Minkä soittolistan haluat toistaa?";

/* Dialogi-viestit */
"play_playlist_dialog" = "Toistetaan soittolistaa %@";
"Playlist not found. Use 'Get Playlists' to see available playlists." = "Soittolistaa ei löytynyt. Käytä 'Hae soittolistat' nähdäksesi saatavilla olevat soittolistat.";
"No playlists found" = "Soittolistoja ei löytynyt";

/* Tehosteiden nimet */
"ProjectM" = "ProjectM";
"Oscillo" = "Oskilloskooppi";
"Piano roll" = "Pianorulla";
"3D Piano" = "3D-piano";
"Notes bars" = "Nuottipalkit";
"Tracker" = "Seuranta";
"2D Spectrum" = "2D-spektri";
"3D Spectrum" = "3D-spektri";
"3D Landscape" = "3D-maisema";

// ================================

"Get Now Playing" = "Hae nyt soiva";
"Which playlist would you like to play?" = "Minkä soittolistan haluat soittaa?";


// ================================
// MARK: - TABS
// ================================

"Search" = "Hae";
"More" = "Lisää";
"Suspend" = "Keskeytä";
"Clear all" = "Tyhjennä kaikki";
"Online" = "Online";


// ================================
// MARK: - MORE TAB
// ================================

"About" = "Tietoja";
"Some general informations" = "Yleisiä tietoja";
"Settings" = "Asetukset";
"Global, Visu, FTP & Plugins" = "Yleiset, Visu, FTP ja liitännäiset";
"Maintenance" = "Ylläpito";
"Clean DB, Reset ratings, ..." = "Puhdista tietokanta, nollaa arvostelut, ...";


// ================================
// MARK: - ONLINE TAB / COLLECTIONS
// ================================

/* Section Headers */
"Collections" = "Kokoelmat";
"Browse Internet" = "Selaa Internetiä";
"Games Music" = "Pelimusiikki";
"Mods & chiptunes" = "Modit ja chiptune-musiikki";
"Other" = "Muut";

/* Collections */
"MODLAND collection" = "MODLAND-kokoelma";
"HVSC collection" = "HVSC-kokoelma";
"ASMA collection" = "ASMA-kokoelma";
"JOSHW collection" = "JOSHW-kokoelma";
"VGMRips collection" = "VGMRips-kokoelma";
"SNESmusic collection" = "SNESmusic-kokoelma";
"SMS Power! collection" = "SMS Power! -kokoelma";
"ZXArt collection" = "ZXArt-kokoelma";

/* Collection Descriptions */
"%d entries" = "%d merkintää";
"Thousands of entries" = "Tuhansia merkintöjä";
"2K+ packs / 40K+ songs" = "2K+ pakettia / 40K+ kappaletta";
"1500+ sets / Super Nintendo/Famicom" = "1500+ settiä / Super Nintendo/Famicom";
"Master System & Game gear sets" = "Master System ja Game Gear -setit";
"ZX Spectrum" = "ZX Spectrum";

/* Internet */
"Modizer World Charts" = "Modizer maailmanlistat";
"Web browser" = "Verkkoselain";
"No internet connectivity or website down." = "Ei Internet-yhteyttä tai verkkosivusto ei toimi.";

// ================================
// MARK: - SETTINGS - FAMILIES & UI
// ================================

/* Settings Families */
"Global" = "Yleiset";
"Default Players" = "Oletussoittimet";
"Visualizers" = "Visualisoijat";
"PR & NS colors settings" = "PR ja NS -väriasetukset";
"Plugins" = "Liitännäiset";

/* Player Selection */
"MOD player" = "MOD-soitin";
"SAP player" = "SAP-soitin";
"SID player" = "SID-soitin";
"VGM player" = "VGM-soitin";
"YM player" = "YM-soitin";
"NSF player" = "NSF-soitin";
"PT3 player" = "PT3-soitin";
"GBS player" = "GBS-soitin";
"KSS player" = "KSS-soitin";
"2SF player" = "2SF-soitin";
"MIDI player" = "MIDI-soitin";

/* Global Player Settings - Additional Descriptions */
"Only for plugins supporting this feature (GME, NSFPLAY, LIBVGM)" = "Vain tätä ominaisuutta tukeville liitännäisille (GME, NSFPLAY, LIBVGM)";
"0=auto, delay rounded to a multiple of audio buffer size" = "0=auto, viive pyöristetty äänipuskurin koon monikertaan";
"Limited: not for subsong" = "Rajoitettu: ei alakappaleille";
"Default value is 3s" = "Oletusarvo on 3s";
"Default action when selecting an archive or a multisong file" = "Oletustoiminto arkiston tai monikappaletiedoston valinnassa";
"Play only selected entry or full archive/multisong file" = "Toista vain valittu merkintä tai koko arkisto/monikappaletiedosto";
"Show Welcome screen" = "Näytä tervetuloruutu";
"Adplug priority for module" = "Adplug-prioriteetti moduulille";

/* FTP Settings */
"Server status" = "Palvelimen tila";
"FTP Server" = "FTP-palvelin";
"Authorize anonymous" = "Salli anonyymi";
"User" = "Käyttäjä";
"Password" = "Salasana";
"Port" = "Portti";

/* Online Settings */
"MODLAND URL" = "MODLAND URL";
"HVSC URL" = "HVSC URL";
"ASMA URL" = "ASMA URL";
"MODLAND Server" = "MODLAND-palvelin";
"MODLAND cust.URL" = "MODLAND mukaut.URL";
"HVSC Server" = "HVSC-palvelin";
"HVSC cust.URL" = "HVSC mukaut.URL";
"ASMA Server" = "ASMA-palvelin";
"ASMA cust.URL" = "ASMA mukaut.URL";


// ================================
// MARK: - SETTINGS - ADDITIONAL PLUGIN SETTINGS
// ================================

/* Visualization - MOD Pattern */
"Patterns BG Alpha" = "Kuvioiden taustan alpha";
"Opacity of mod patterns view" = "MOD-kuvionäkymän läpinäkyvyys";
"MOD Color Theme" = "MOD-väriteema";
"MOD Current Line" = "MOD nykyinen rivi";
"MOD Volume bars" = "MOD äänenvoimakkuuspalkit";
"MOD Pattern Font" = "MOD-kuvion fontti";
"MOD Pattern Font Size" = "MOD-kuvion fonttikoko";

/* Visualization - Piano Roll / MIDI */
"Piano Roll FX" = "Pianorulla FX";
"PR/Spark FX" = "PR/Kipinä FX";
"Display voices label" = "Näytä äänten nimike";
"Notes scroller FX" = "Nuottivieritin FX";
"NS/bars mode" = "NS/palkkitila";
"NS/bars style" = "NS/palkkityyli";
"Vibrato display" = "Vibrato-näyttö";
"Piano FX" = "Piano FX";
"Piano bars mode" = "Pianon palkkitila";

/* Visualization - Spectrum */
"3D Sp.Bloom" = "3D Sp.Hehku";
"3D Land. Bloom" = "3D Mais. Hehku";
"0: off" = "0: pois";

/* ProjectM Settings */
"ProjectM FX" = "ProjectM FX";
"Rendering quality: Max is pixel resolution, 1/2 is half, ..." = "Renderöintilaatu: Max on pikseliresoluutio, 1/2 on puolet, ...";
"Custom presets/textures should be copied in .projectm folder" = "Mukautetut esiasetukset/tekstuurit tulee kopioida .projectm-kansioon";
"Display preset name" = "Näytä esiasetuksen nimi";
"Lim: display and disappear quickly" = "Raj: näytä ja häviä nopeasti";
"Auto switch presets" = "Automaattinen esiasetusten vaihto";
"Allow loading of milk file with script issues" = "Salli milk-tiedoston lataus skriptiongelmista huolimatta";
"Default is 15s" = "Oletus on 15s";
"Default is 2.7s" = "Oletus on 2.7s";
"Default value is 32" = "Oletusarvo on 32";
"Default value is 24" = "Oletusarvo on 24";
"Default value is 20" = "Oletusarvo on 20";
"Hardcut" = "Kova leikkaus";
"Hardcut triggers presets switch synchronized with beats." = "Kova leikkaus käynnistää esiasetusten vaihdon rytmin mukaisesti.";
"Hardcut min time" = "Kovan leikkauksen min. aika";
"Preserve aspect ratio for compatible shaders." = "Säilytä kuvasuhde yhteensopivilla shadeilla.";
"Default value is 1" = "Oletusarvo on 1";
"Hardcut sensitivity" = "Kovan leikkauksen herkkyys";

/* Oscilloscope Settings */
"Oscillo FX" = "Oskilloskooppi FX";
"Oscillo show labels" = "Oskill. näytä nimiket";
"Oscillo labels font size" = "Oskill. nimikkeiden fonttikoko";
"Oscillo show grid" = "Oskill. näytä ruudukko";
"Oscillo line width" = "Oskill. viivan leveys";
"Reset all custom colors" = "Nollaa kaikki mukautetut värit";
"Multi color | System 1" = "Moniväri | Järjestelmä 1";
"Multi color | System 2" = "Moniväri | Järjestelmä 2";
"Multi color | System 3" = "Moniväri | Järjestelmä 3";
"Multi color | System 4" = "Moniväri | Järjestelmä 4";
"Multi color | System 5" = "Moniväri | Järjestelmä 5";
"Multi color | System 6" = "Moniväri | Järjestelmä 6";
"Multi color | System 7" = "Moniväri | Järjestelmä 7";
"Multi color | System 8" = "Moniväri | Järjestelmä 8";

/* Piano/MIDI Colors */
"Custom color 01" = "Mukautettu väri 01";
"Custom color 02" = "Mukautettu väri 02";
"Custom color 03" = "Mukautettu väri 03";
"Custom color 04" = "Mukautettu väri 04";
"Custom color 05" = "Mukautettu väri 05";
"Custom color 06" = "Mukautettu väri 06";
"Custom color 07" = "Mukautettu väri 07";
"Custom color 08" = "Mukautettu väri 08";
"Custom color 09" = "Mukautettu väri 09";
"Custom color 10" = "Mukautettu väri 10";
"Custom color 11" = "Mukautettu väri 11";
"Custom color 12" = "Mukautettu väri 12";
"Custom color 13" = "Mukautettu väri 13";
"Custom color 14" = "Mukautettu väri 14";
"Custom color 15" = "Mukautettu väri 15";
"Custom color 16" = "Mukautettu väri 16";
"Custom color 17" = "Mukautettu väri 17";
"Custom color 18" = "Mukautettu väri 18";
"Custom color 19" = "Mukautettu väri 19";
"Custom color 20" = "Mukautettu väri 20";
"Custom color 21" = "Mukautettu väri 21";
"Custom color 22" = "Mukautettu väri 22";
"Custom color 23" = "Mukautettu väri 23";
"Custom color 24" = "Mukautettu väri 24";
"Custom color 25" = "Mukautettu väri 25";
"Custom color 26" = "Mukautettu väri 26";
"Custom color 27" = "Mukautettu väri 27";
"Custom color 28" = "Mukautettu väri 28";
"Custom color 29" = "Mukautettu väri 29";
"Custom color 30" = "Mukautettu väri 30";
"Custom color 31" = "Mukautettu väri 31";
"Custom color 32" = "Mukautettu väri 32";

/* Plugin Settings - Libopenmpt */
"Libopenmpt" = "Libopenmpt";

/* Plugin Settings - GME */
"GME" = "GME";
"Will skip song if nothing is played for specified duration (0=off)" = "Ohittaa kappaleen, jos mitään ei toisteta määritetyn ajan (0=pois)";

/* Plugin Settings - GSF */
"GSF" = "GSF";

/* Plugin Settings - NSFPLAY */
"NSFPLAY" = "NSFPLAY";
"Default length" = "Oletuspituus";
"Oversampling. Min=0, default: 10" = "Ylinäytteistys. Min=0, oletus: 10";
"Min=off, default: 112" = "Min=pois, oletus: 112";
"Max=off, default: 164" = "Max=pois, oletus: 164";
"1/2/3=NTSC/PAL/DENDY\n4/5/6=force NTSC/PAL/DENDY" = "1/2/3=NTSC/PAL/DENDY\n4/5/6=pakota NTSC/PAL/DENDY";
"Forces IRQ capability for all NSFs, not just NSF2" = "Pakottaa IRQ-ominaisuuden kaikille NSF:ille, ei vain NSF2:lle";
"APU unmute on reset" = "APU äänenvahvistus nollauksessa";
"APU phase reset" = "APU vaiheen nollaus";
"APU non linear mixing" = "APU epälineaarinen miksaus";
"APU swap duty 1/2" = "APU vaihda duty 1/2";
"APU Initialize sweep unmute" = "APU alusta sweep äänenvahvistus";
"DMC enable $4011 writes" = "DMC käytä $4011 kirjoituksia";
"DMC enable periodic noise" = "DMC käytä jaksollinen kohina";
"DMC unmute on reset" = "DMC äänenvahvistus nollauksessa";
"DMC anti clicking" = "DMC estetään napsautuksia";
"DMC non linear mixer" = "DMC epälineaarinen mikseri";
"DMC randomize noise on reset" = "DMC satunnaista kohina nollauksessa";
"DMC mute triangle on pitch 0" = "DMC vaimenna kolmio sävelkorkeudella 0";
"prevents high frequency aliasing" = "estää korkean taajuuden aliasing";
"DMC rand. triangle" = "DMC satun. kolmio";
"randomize triangle on reset" = "satunnaista kolmio nollauksessa";
"DMC reverse bits" = "DMC käänteinen bitit";
"reverse bits of DPCM sample bytes" = "käänteinen DPCM-näytteiden tavujen bitit";
"MMC5 non linear mixing" = "MMC5 epälineaarinen miksaus";
"MMC5 Phase reset" = "MMC5 vaiheen nollaus";
"Reset phase counter after write $5003 and $5007" = "Nollaa vaiheen laskuri kirjoituksen $5003 ja $5007 jälkeen";
"FDS LP filter in Hz" = "FDS LP-suodatin Hz:ssä";
"Cutoff frequency (0Hz=off, 2000Hz=default)" = "Katkaisutaajuus (0Hz=pois, 2000Hz=oletus)";
"FDS reset \"phase\"" = "FDS nollaa \"vaihe\"";
"$4085 \"resets\" modular phase" = "$4085 \"nollaa\" modulaarisen vaiheen";
"FDS write protect" = "FDS kirjoitussuojaus";
"write protect $8000-DFFF" = "kirjoitussuojaa $8000-DFFF";
"VRC7 Replace with OPLL" = "VRC7 korvaa OPLL:llä";
"N163 Serial Multiplex mixing" = "N163 sarjamultipleksi miksaus";
"N163 Write Protect Phase" = "N163 kirjoitussuojaus vaihe";
"N163 Limit Wavelength" = "N163 rajoita aallonpituus";

/* Plugin Settings - ADPLUG */
"ADPLUG" = "ADPLUG";

/* Plugin Settings - HC (Highly Complete) */
"HC" = "HC";
"Only for HC plugin" = "Vain HC-liitännäiselle";

/* Plugin Settings - SID */
"SID" = "SID";
"Digiboost" = "Digiboost";

/* Plugin Settings - TIMIDITY */
"TIMIDITY" = "TIMIDITY";

/* Plugin Settings - UADE */
"UADE" = "UADE";
"Panning value" = "Panorointiarvo";
"Gain value" = "Vahvistusarvo";

/* Plugin Settings - VGMPlay */
"VGMPLAY" = "VGMPLAY";

/* Plugin Settings - VGMStream */
"VGMSTREAM" = "VGMSTREAM";

/* Plugin Settings - XMP */
"XMP" = "XMP";

/* Plugin Settings - SEXYPSF */
"SEXYPSF" = "SEXYPSF";

/* Plugin Settings - GBSPlay */
"GBS" = "GBS";

/* Plugin Settings - STSOUND */
"STSOUND" = "STSOUND";

/* Plugin Settings - SC68 */
"SC68" = "SC68";

/* Additional Settings */
"Disable" = "Poista käytöstä";
"Enter playlist name" = "Anna soittolistan nimi";
"Ask" = "Kysy";
"Play All" = "Toista kaikki";
"Single" = "Yksittäinen";
"Archive" = "Arkisto";
"On" = "Päällä";
"Off" = "Pois";
"Lim" = "Raj";

// ================================
// MARK: - PLAYLISTS - ADDITIONAL ENTRIES
// ================================

/* Playlist Menu Entries */
"Add a playlist" = "Lisää soittolista";
"Create a new playlist" = "Luo uusi soittolista";
"Now playing" = "Nyt soi";
"1 entry" = "1 merkintä";
"No entry" = "Ei merkintöjä";
"Random picks" = "Satunnaisvalinnat";
"Generate a randomized playlist" = "Luo satunnaistettu soittolista";
"Most played" = "Useimmin soitetut";
"Favorites" = "Suosikit";

/* Playlist Actions */
"Add/Remove files..." = "Lisää/Poista tiedostoja...";
"More actions..." = "Lisää toimintoja...";
"Save as a new playlist" = "Tallenna uutena soittolistana";

// ================================
// MARK: - WELCOME PAGES
// ================================

"Welcome to Modizer!\n" = "Tervetuloa Modizeriin!\n";
"Level up your library" = "Paranna kirjastoasi";
"Sound meets visuals." = "Ääni kohtaa visuaalit.";
"Made with passion,\noffered for free." = "Tehty intohimolla,\ntarjotaan ilmaiseksi.";

/* Welcome Page Messages */
"Your gateway to retro and tracker music.\nPower up your device with legendary game tunes, iconic tracker modules, and timeless chiptune classics." = "Porttisi retro- ja tracker-musiikkiin.\nVahvista laitteesi legendaarisilla pelisävellyksillä, ikonisilla tracker-moduuleilla ja ajattomilla chiptune-klassikoilla.";

"Browse and stream from online catalogs, to complete your own collections.\nBuild, edit, and listen to playlists effortlessly." = "Selaa ja suoratoista verkkokirjastoista täydentääksesi omia kokoelmiasi.\nRakenna, muokkaa ja kuuntele soittolistoja vaivattomasti.";

"Unlock classic oscilloscope looks, spectrum bars, piano rolls, trackers view and ProjectM/Milkdrop FX. Let Modizer paint each track with motion and color." = "Avaa klassinen oskilloskooppi-ilme, spektripalkit, pianorullat, tracker-näkymä ja ProjectM/Milkdrop FX. Anna Modizerin maalata jokainen kappale liikkeellä ja värillä.";

"If you enjoy the app, tips are a great way to support its ongoing development.\nThank you for helping keep Modizer alive and evolving." = "Jos pidät sovelluksesta, tipit ovat loistava tapa tukea sen jatkuvaa kehitystä.\nKiitos, että autat pitämään Modizerin elossa ja kehittyvänä.";

"Skip" = "Ohita";

// ================================
// MARK: - TIPS / DONATIONS
// ================================

/* Tips Screen */
"Support with a Tip" = "Tue tipillä";
"Enjoy Modizer ?" = "Pidätkö Modizerista?";
"Your support helps keep Modizer running and ad-free!" = "Tukesi auttaa pitämään Modizerin toiminnassa ja mainoksettomana!";
"Already tipped so far" = "Jo tähän mennessä tipitetty";
"Thank you for your support! ❤️" = "Kiitos tuestasi! ❤️";

/* Tip Tiers */
"Coffee" = "Kahvi";
"Coffee & Croissant" = "Kahvi ja croissant";
"Dinner" = "Illallinen";
"Loading..." = "Ladataan...";

/* Tip Actions */
"Confirm Tip" = "Vahvista tippi";
"Send Tip" = "Lähetä tippi";
"Send a %@ tip for %@?" = "Lähetä %@ tippi kohteelle %@?";
"Tip" = "Tippi";

/* Tip Errors */
"Unable to load products. Please check your internet connection." = "Tuotteiden lataus epäonnistui. Tarkista Internet-yhteys.";

/* Thank You Alert */
"Thank You! ❤️" = "Kiitos! ❤️";
"Your support means everything! Thank you for helping keep Modizer running." = "Tukesi merkitsee kaikkea! Kiitos, että autat pitämään Modizerin toiminnassa.";

// ================================
// MARK: - MAINTENANCE SCREEN
// ================================

/* Maintenance Actions */
"Clean Database" = "Puhdista tietokanta";
"Clear 'Now Playing' queue" = "Tyhjennä 'Nyt soi' -jono";
"Recreate Samples folder" = "Luo Samples-kansio uudelleen";
"Reset settings to default" = "Palauta asetukset oletuksiksi";
"Remove current cover" = "Poista nykyinen kansikuva";
"Reset Ratings" = "Nollaa arvostelut";
"Reset Played Counters" = "Nollaa toistolaskurit";
"Reset Database" = "Nollaa tietokanta";
"Clear images cache" = "Tyhjennä kuvavälimuisti";

/* Maintenance Messages */
"Settings reseted" = "Asetukset nollattu";
"Ratings reseted" = "Arvostelut nollattu";
"Played Counters reseted" = "Toistolaskurit nollattu";
"Samples folder created" = "Samples-kansio luotu";
"Cache cleaned" = "Välimuisti tyhjennetty";
"Database reseted" = "Tietokanta nollattu";
"No cover to remove" = "Ei poistettavaa kansikuvaa";
"Cover removed" = "Kansikuva poistettu";
"Database cleaned" = "Tietokanta puhdistettu";

/* Maintenance Confirmations */
"Are you sure you want to clean the DB, it might take a while ?" = "Haluatko varmasti puhdistaa tietokannan? Se voi kestää hetken.";
"Clean" = "Puhdista";
"Cleaning DB" = "Puhdistetaan tietokantaa";
"Cancelling..." = "Peruutetaan...";

// ================================
// MARK: - PLAYERMENU
// ================================

"Close FX\nwindow" = "Sulje FX\nikkuna";
"All FX off" = "Kaikki FX pois";
"FX\nalpha" = "FX\nalpha";
"Show name\ntemp." = "Näytä nimi\nväliaikaisesti";
"Show name" = "Näytä nimi";
"Bundled\npresets" = "Sisäänrakennetut\nesiasetukset";
"Custom\npresets" = "Mukautetut\nesiasetukset";
"Blend\npresets" = "Sekoita\nesiasetukset";
"Clear\nall" = "Tyhjennä\nkaikki";
"Select\nall" = "Valitse\nkaikki";
"Favorites" = "Suosikit";
"Expand" = "Laajenna";
"Select\nlisted" = "Valitse\nlistatut";
"Remove\nlisted" = "Poista\nlistatut";
"Selected" = "Valittu";
"Collapse" = "Pienennä";
"Labels" = "Nimiket";
"Grid" = "Ruudukko";
"Voices\nlabels" = "Äänten\nnimiket";
"Octaves\nlabels" = "Oktaavien\nnimiket";
"Volume\nbars" = "Äänenvoimakkuus\npalkit";
"Fixed bar" = "Kiinteä palkki";
"BG\nopacity" = "Taustan\nläpinäkyvyys";
"Bloom:\n%s" = "Hehku:\n%s";
"Thickness:\n%s" = "Paksuus:\n%s";
"Font size\n%s" = "Fonttikoko\n%s";
"Font:\n%s" = "Fontti:\n%s";
"Info HUD:\n%s" = "Info HUD:\n%s";
"Select active %s presets" = "Valitse aktiiviset %s esiasetukset";
"bundled" = "sisäänrakennetut";
"custom" = "mukautetut";
"Select\ncustom\npresets" = "Valitse\nmukautetut\nesiasetukset";
"Select\nbundled\npresets" = "Valitse\nsisäänrakennetut\nesiasetukset";
"Themes:\n%s" = "Teemat:\n%s";


